# lexicon.py

# Sentiment Lexicon
lexicon = {
    'खुश': 1,
    'शुभ': 1,
    'दोस्ताना ': 1,
    'दिलचस्प': 1,
    'फलदायी': 1,
    'फलदायक': 1,
    'जबर्दस्त': 1,
    'खूब': 1,
    'बेहतरीन': 1,
    'भरपूर': 1,
    'भला': 1,
    'सहज': 1,
    'महत्वाकांक्षी': 1,
    'भक्तिभाव': 1,
    'सेहतमंद': 1,
    'विकास': 1,
    'मजेदार': 1,
    'सुखद ': 1,
    'निरंतर': 1,
    'बड़ा': 1,
    'साकार': 1,
    'तेज': 1,
    'सुखद': 1,
    'ज्यादातर': 1,
    'दीवाना': 1,
    'धन्यवाद': 1,
    'तलाशना': 1,
    'आशा': 1,
    'संतुष्ट': 1,
    'जीत': 1,
    'प्यार': 1,
    'आनंद':1,
    'आरोग्यता': 1,
    'प्रयास': 1,
    'आज्ञा': 1,
    'बढ़त': 1,
    'इच्छित': 1,
    'मनपसंद': 1,
    'सुखदायक': 1,
    'विद्यमान': 1,
    'अनुपम': 1,
    'फलदार': 1,
    'महत्वपूर्ण': 1,
    'आनंद': 1,
    'इंद्रियगम्य': 1,
    'आनंददायक': 1,
    'सुखी': 1,
    'शुक्रगुजार': 1,
    'सफलता': 1,
    'अच्छा': 1,
    'बुरा': -1,
    'दुःख': -1,
    'खराब': -1,
    'निराश': -1,
    'विरोध': -1,
    'घबराना': -1,
    'संकट': -1,
    'नफरत': -1,
    'शिकायत': -1,
    'बेरोज़गारी': -1,
    'संगीन': -1,
    'संकोच': -1,
    'नहीं': -1,
    'बेकार': -1,
    'गैरजरूरी': -1,
    'असफल': -1,
    'अन्याय': -1,
    'अन्यायपूर्ण': -1,
    'अन्यायी': -1,
    'बीमारियां': -1,
    'बेपरवाह': -1,
    'रिटायर': -1,
    'जाम': -1,
    'ठीकठाक': -1,
    'समस्या': -1,    
    'मांग': 0,
    'बातचीत': 0,
    'समझ': 0,
    'किताब': 0,
    'फाइल': 0,
    'सामान्य': 0,
    'घड़ी': 0,
    'हॉल' : 0,
    'ब्रेक': 0,
    'वाहन': 0,
    'ऑर्डर': 0,
    'पासवर्ड': 0,
    'चढ़': 0,
    'रिसीव': 0,
    'स्टोर': 0,
    'निर्धारित': 0,
    'बंद': 0,
    'बाहर': 0,
    'गर्मी': 0,
    'व्यवस्थित': 0,
    'खत्म': 0,
    'दस्तावेज़': 0,
    'साफ': 0,
    'ग्राहकों': 0,

}

def analyze_sentiment(text):
    """
    Analyzes Hindi text for sentiment and calculates polarity.
    :param text: Input string
    :return: Sentiment and polarity
    """
    words = text.split()
    score = 0
    for word in words:
        if word in lexicon:
            score += lexicon[word]

    # Determine sentiment
    if score > 0:
        sentiment = "Positive"
    elif score < 0:
        sentiment = "Negative"
    else:
        sentiment = "Neutral"
    
    # Polarity is the score itself
    polarity = score

    return sentiment, polarity
